app/controllers/ventures_controller.rb

SELECT * FROM "ventures"
---
  def index
    @svc_messages = Message.all(:order=>'created_at DESC')

		@newest_ventures = Venture.all(:order=>'id DESC', :limit => 10)

SELECT * FROM "ventures" WHERE ("ventures"."id" = 1)
---
  def show
    @venture = Venture.find(params[:id])